Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: The following example binds to all IP addresses on the host::
it_it: L'esempio seguente si collega a tutti gli indirizzi IP dell'host::

source: The following example sets "name" to "CUSTOM_XML_ONLY" and its value to "True".
it_it: L'esempio seguente imposta "name" a "CUSTOM_XML_ONLY" e il suo valore su "True".

source: The following figure shows a high-level build environment regarding toolchain construction and use.
it_it: La figura seguente mostra un ambiente di build di alto livello per quanto riguarda la creazione e l'utilizzo delle toolchain.

source: The following figure shows an expanded representation of the "User Configuration" box of the :ref:`general workflow figure <overview-manual/concepts:openembedded build system concepts>`:
it_it: La figura seguente mostra una rappresentazione ingrandita della casella "User Configuration" della :ref:`della figura del flusso di lavoro generale <overview-manual/concepts:openembedded build system concepts>`:

source: The following figure shows an expanded representation of these three layers from the :ref:`general workflow figure <overview-manual/concepts:openembedded build system concepts>`:
it_it: La figura seguente mostra una rappresentazione estesa di questi tre layer, tratta dalla :ref:`figura del flusso di lavoro generale <overview-manual/concepts:openembedded build system concepts>`:

source: The following illustration and list summarize the BSP creation general workflow.
it_it: L'illustrazione e l'elenco seguenti riassumono il flusso di lavoro generale per la creazione di un BSP.

source: The following list explains the previous example:
it_it: Il seguente elenco spiega l'esempio precedente:

source: The following list of Git commands briefly describes some basic Git operations as a way to get started. As with any set of commands, this list (in most cases) simply shows the base command and omits the many arguments it supports. See the Git documentation for complete descriptions and strategies on how to use these commands:
it_it: Il seguente elenco di comandi Git descrive brevemente alcune operazioni di base per iniziare. Come per qualsiasi elenco di comandi, questo (nella maggior parte dei casi) mostra solo il comando base, omettendo i numerosi argomenti supportati. Consultare la documentazione di Git per descrizioni complete e strategie su come utilizzare questi comandi:

source: The following list provides some explanation and references for what you typically find in a distribution layer (recall that :yocto_git:`meta-poky </meta-yocto/tree/meta-poky>` is such a layer):
it_it: Il seguente elenco fornisce alcune spiegazioni e riferimenti su ciò che si trova tipicamente in un layer di distribuzione (ricordare che :yocto_git:`meta-poky </meta-yocto/tree/meta-poky>` è un tale layer):

source: The following list provides some explanation for the statements found in the example reference machine configuration file for the BeagleBone development board. Realize that much more can be defined as part of a machine's configuration file. In general, you can learn about related variables that this example does not have by locating the variables in the ":ref:`ref-manual/variables:variables glossary`" in the Yocto Project Reference Manual.
it_it: L'elenco seguente fornisce alcune spiegazioni per le istruzioni presenti nel file di configurazione di riferimento di esempio per la scheda di sviluppo BeagleBone. Si tenga presente che è possibile definire molto altro all'interno di un file di configurazione della macchina. In generale, è possibile trovare informazioni sulle variabili correlate non presenti in questo esempio consultando ":ref:`ref-manual/variables:variables glossary`" nel Manuale di Riferimento di Yocto Project.

source: The following sections describe each part of the proposed BSP format.
it_it: Le sezioni seguenti descrivono ciascuna parte del formato BSP proposto.

source: The following subsections describe each of the sections in the fixture files, and outline an example section of the XML code. you can use to help understand this information and create a local ``custom.xml`` file.
it_it: Le seguenti sottosezioni descrivono ciascuna sezione dei file di fixture e forniscono un esempio di sezione del codice XML utilizzabile per comprendere queste informazioni e creare un file ``custom.xml`` locale.

source: The following task definition is glue logic needed to make the previous settings effective::
it_it: La seguente definizione di task rappresenta la logica di collegamento necessaria per rendere effettive le impostazioni precedenti::

source: The following variables should be included in all recipes:
it_it: Le seguenti variabili devono essere incluse in tutte le ricette:

source: The formatting of shell functions should be consistent within layers. Some use tabs, some use spaces.
it_it: La formattazione delle funzioni shell deve essere coerente all'interno dei layer. Alcune utilizzano le tabulazioni, altre gli spazi.

source: The fourth milestone (M4) is not actually released and announced, but represents a point of time for the Quality Assurance team to start the :ref:`ref-manual/release-process:Testing and Quality Assurance` process before tagging and delivering the final release.
it_it: La quarta milestone (M4) non viene effettivamente rilasciata e annunciata, ma rappresenta un momento in cui il team di Controllo Qualità avvia il processo di :ref:`ref-manual/release-process:Testing and Quality Assurance` prima di etichettare e rilasciare la versione finale.

source: The ftrace function tracer is also available from within perf, as the ``ftrace:function`` tracepoint.
it_it: Il tracer function ftrace è disponibile anche all'interno di perf, come tracepoint ``ftrace:function``.

source: The function tracer gives you an extremely detailed idea of what the kernel was doing at the point in time the trace was taken, and is a great way to learn about how the kernel code works in a dynamic sense.
it_it: Il tracer function fornisce un'idea estremamente dettagliata di cosa stava facendo il kernel nel momento in cui è stata acquisita la traccia ed è un ottimo strumento per comprendere il funzionamento dinamico del codice del kernel.

source: The generated barebox binaries are deployed to :term:`DEPLOY_DIR_IMAGE` as well as installed to ``BAREBOX_INSTALL_PATH`` (``/boot`` by default) making them part of the recipe's base package. This setup supports both using the barebox binaries as independent artifacts and installing them into a rootfs. :term:`BAREBOX_BINARY` can be used to select a distinct binary to deploy and install. If ``barebox`` is set as the :term:`EFI_PROVIDER`, the class will leverage :oe_git:`conf/image-uefi.conf </openembedded-core/tree/meta/conf/image-uefi.conf>` to define the default installation paths and naming conventions.
it_it: I binari barebox generati vengono distribuiti in :term:`DEPLOY_DIR_IMAGE` e installati in ``BAREBOX_INSTALL_PATH`` (``/boot`` per default), diventando così parte del pacchetto base della ricetta. Questa configurazione supporta sia l'utilizzo dei binari barebox come artefatti indipendenti, sia la loro installazione in un rootfs. :term:`BAREBOX_BINARY` può essere utilizzato per selezionare un binario distinto da distribuire e installare. Se ``barebox`` è impostato come :term:`EFI_PROVIDER`, la classe utilizzerà :oe_git:`conf/image-uefi.conf </openembedded-core/tree/meta/conf/image-uefi.conf>` per definire i percorsi di installazione predefiniti e le convenzioni di denominazione.

source: The hash equivalence server needs the websockets python module version 9.1 or later. Debian GNU/Linux 12 (Bookworm) and later, Fedora, CentOS Stream 9 and later, and Ubuntu 22.04 (LTS) and later, all have a recent enough package. Other supported distributions need to get the module some other place than their package feed, e.g. via ``pip``. You can otherwise install a :term:`Buildtools` tarball by following the instructions in the :ref:`system-requirements-buildtools` section of the Yocto Project Reference Manual.
it_it: Il server di equivalenza hash richiede il modulo Python websockets versione 9.1 o successiva. Debian GNU/Linux 12 (Bookworm) e versioni successive, Fedora, CentOS Stream 9 e versioni successive e Ubuntu 22.04 (LTS) e versioni successive dispongono tutte di un pacchetto sufficientemente recente. Le altre distribuzioni supportate devono ottenere il modulo da una fonte diversa dal proprio feed di pacchetti, ad esempio tramite ``pip``. In alternativa, è possibile installare un tarball di :term:`Buildtools` seguendo le istruzioni nella sezione :ref:`system-requirements-buildtools` del Manuale di Riferimento di Yocto Project.

source: The idea of a setscene task (i.e ``do_taskname_setscene``) is a version of the task where instead of building something, BitBake can skip to the end result and simply place a set of files into specific locations as needed. In some cases, it makes sense to have a setscene task variant (e.g. generating package files in the :ref:`do_package_write_* <ref-tasks-package_write_deb>` task). In other cases, it does not make sense (e.g. a :ref:`ref-tasks-patch` task or a :ref:`ref-tasks-unpack` task) since the work involved would be equal to or greater than the underlying task.
it_it: L'idea di un task setscene (ad esempio ``do_taskname_setscene``) è una versione del task in cui, invece di compilare qualcosa, BitBake può passare direttamente al risultato finale e posizionare semplicemente un insieme di file in posizioni specifiche a seconda delle necessità. In alcuni casi, ha senso avere una variante del task setscene (ad esempio, la generazione di file di pacchetto nel task :ref:`do_package_write_* <ref-tasks-package_write_deb>`). In altri casi, non ha senso (ad esempio, un task :ref:`ref-tasks-patch` o un task :ref:`ref-tasks-unpack`) poiché il lavoro richiesto sarebbe uguale o superiore a quello del task sottostante.

source: The image generation process consists of several stages and depends on several tasks and variables. The :ref:`ref-tasks-rootfs` task creates the root filesystem (file and directory structure) for an image. This task uses several key variables to help create the list of packages to actually install:
it_it: Il processo di generazione dell'immagine si compone di diverse fasi e dipende da diversi task e variabili. Il task :ref:`ref-tasks-rootfs` crea il filesystem root (struttura di file e directory) per un'immagine. Questo task utilizza diverse variabili chiave per creare l'elenco dei pacchetti da installare:

source: The images produced by the build system are compressed forms of the root filesystem and are ready to boot on a target device. You can see from the :ref:`general workflow figure <overview-manual/concepts:openembedded build system concepts>` that BitBake output, in part, consists of images. This section takes a closer look at this output:
it_it: Le immagini prodotte dal sistema di build sono versioni compresse del filesystem root e sono pronte per l'avvio su un dispositivo target. Come si può vedere nella :ref:`figura del flusso di lavoro generale <overview-manual/concepts:openembedded build system concepts>`, l'output di BitBake è costituito, in parte, da immagini. Questa sezione esamina più da vicino questo output:

source: The include statement that pulls in the ``conf/machine/include/arm/tune-cortexa8.inc`` file provides many tuning possibilities.
it_it: L'istruzione include che carica il file ``conf/machine/include/arm/tune-cortexa8.inc`` offre numerose possibilità di ottimizzazione.

source: The infrastructure behind the test environment is the :ref:`Yocto Project Autobuilder <test-manual/intro:Yocto Project Autobuilder Overview>`. The Autobuilder contains a set of Builders that are associated to an architecture or a feature to test. For example, the ``qemuarm64`` builder corresponds to testing the ARM 64-bit architecture.
it_it: L'infrastruttura alla base dell'ambiente di test è :ref:`Yocto Project Autobuilder <test-manual/intro:Yocto Project Autobuilder Overview>`. L'Autobuilder contiene una serie di Builder associati a un'architettura o a una funzionalità da testare. Ad esempio, il builder ``qemuarm64`` corrisponde al test dell'architettura ARM a 64 bit.

source: The kernel recipe used to build the kernel image for the BeagleBone device was established in the machine configuration::
it_it: La ricetta del kernel utilizzata per creare l'immagine del kernel per il dispositivo BeagleBone è stata definita nella configurazione della macchina::

source: The layer "pk" values above must be unique, and typically start at "1". The layer version "pk" values must also be unique across all layers, and typically start at "1".
it_it: I valori "pk" del layer sopra indicati devono essere univoci e in genere iniziano da "1". Anche i valori "pk" della versione del layer devono essere univoci per tutti i layer e in genere iniziano da "1".

source: The layer index is then scanned and added to the database.
it_it: L'indice dei layer viene quindi scansionato e aggiunto al database.

source: The layer's ``conf`` directory contains the ``layer.conf`` configuration file. In this example, the ``conf/layer.conf`` file is the following::
it_it: La directory ``conf`` del layer contiene il file di configurazione ``layer.conf``. In questo esempio, il file ``conf/layer.conf`` ha il seguente contenuto::

source: The left pane shows a list of functions and processes. Selecting one of those expands that function in the right pane, showing all its callees. Note that this caller-oriented display is essentially the inverse of perf's default callee-oriented call chain display.
it_it: Il riquadro di sinistra mostra un elenco di funzioni e processi. Selezionandone uno, la funzione corrispondente si espande nel riquadro di destra, mostrando tutti i processi che la chiamano. Si noti che questa visualizzazione orientata al chiamante è essenzialmente l'inverso della visualizzazione predefinita della catena di chiamate di perf, orientata al chiamato.

source: The licenses you specify within :term:`LICENSE` can have any name as long as you do not use spaces, since spaces are used as separators between license names. For standard licenses, use the names of the files in ``meta/files/common-licenses/`` or the :term:`SPDXLICENSEMAP` flag names defined in ``meta/conf/licenses.conf``.
it_it: Le licenze specificate in :term:`LICENSE` possono avere qualsiasi nome, purché non contengano spazi, poiché questi vengono utilizzati come separatori tra i nomi delle licenze. Per le licenze standard, utilizzare i nomi dei file in ``meta/files/common-licenses/`` o i nomi dei flag :term:`SPDXLICENSEMAP` definiti in ``meta/conf/licenses.conf``.

source: The list of files for a package is defined using the override syntax by separating :term:`FILES` and the package name by a colon (``:``).
it_it: L'elenco dei file per un pacchetto viene definito utilizzando la sintassi di override, separando i :term:`FILES` e il nome del pacchetto con due punti (``:``).

source: The list of packages you need on the host development system can be large when covering all build scenarios using the Yocto Project. This section describes required packages according to Linux distribution and function.
it_it: L'elenco dei pacchetti necessari sul sistema di sviluppo host può essere lungo quando si considerano tutti gli scenari di compilazione con Yocto Project. Questa sezione descrive i pacchetti richiesti in base alla distribuzione Linux e alla funzione.

source: The list of stable branches along with the status and maintainer for each branch can be obtained from the :yocto_home:`Releases </development/releases/>` page.
it_it: L'elenco dei branch stabili, insieme allo stato e al manutentore di ciascun branch, è disponibile nella pagina :yocto_home:`Releases </development/releases/>`.

source: The machine files bind together all the information contained elsewhere in the BSP into a format that the build system can understand. Each BSP Layer requires at least one machine file. If the BSP supports multiple machines, multiple machine configuration files can exist. These filenames correspond to the values to which users have set the :term:`MACHINE` variable.
it_it: I file di configurazione della macchina raggruppano tutte le informazioni contenute altrove nel BSP in un formato comprensibile al sistema di build. Ogni layer BSP richiede almeno un file di configurazione della macchina. Se il BSP supporta più macchine, possono esistere più file di configurazione della macchina. Questi nomi di file corrispondono ai valori che gli utenti hanno impostato per la variabile :term:`MACHINE`.

source: The manifest file (``.manifest``) resides in the same directory as the root filesystem image. This file lists out, line-by-line, the installed packages. The manifest file is useful for the :ref:`ref-classes-testimage` class, for example, to determine whether or not to run specific tests. See the :term:`IMAGE_MANIFEST` variable for additional information.
it_it: Il file manifest (``.manifest``) si trova nella stessa directory dell'immagine del filesystem root. Questo file elenca, riga per riga, i pacchetti installati. Il file manifest è utile, ad esempio, per la classe :ref:`ref-classes-testimage`, per determinare se eseguire o meno test specifici. Consultare la variabile :term:`IMAGE_MANIFEST` per ulteriori informazioni.

source: The manual pages in text form, along with some other files, such as a set of examples, can also be found in the ``perf`` directory of the kernel tree::
it_it: Le pagine del manuale in formato testo, insieme ad altri file, come una serie di esempi, si trovano anche nella directory ``perf`` dell'albero del kernel::

source: The method by which source files are ultimately organized is a function of the project. For example, for released software, projects tend to use tarballs or other archived files that can capture the state of a release guaranteeing that it is statically represented. On the other hand, for a project that is more dynamic or experimental in nature, a project might keep source files in a repository controlled by a Source Control Manager (SCM) such as Git. Pulling source from a repository allows you to control the point in the repository (the revision) from which you want to build software. A combination of the two is also possible.
it_it: Il metodo con cui i file sorgente vengono organizzati dipende dal progetto. Ad esempio, per il software rilasciato, i progetti tendono a utilizzare tarball o altri file archiviati che catturano lo stato di una release, garantendone una rappresentazione statica. D'altra parte, per un progetto più dinamico o sperimentale, i file sorgente potrebbero essere conservati in un repository gestito da un Source Control Manager (SCM) [sistema di controllo versione] come Git. Scaricare il codice sorgente da un repository consente di controllare il punto di partenza (la revisione) da cui si desidera compilare il software. È anche possibile una combinazione dei due metodi.

source: The most common usage for BitBake is ``bitbake recipename``, where ``recipename`` is the name of the recipe you want to build (referred to as the "target"). The target often equates to the first part of a recipe's filename (e.g. "foo" for a recipe file named ``foo_1.3.0.bb``). So, to process the ``matchbox-desktop_1.2.3.bb`` recipe file, you might type the following::
it_it: L'utilizzo più comune di BitBake è ``bitbake recipename``, dove ``recipename`` è il nome della ricetta che si desidera compilare (indicato come "target"). Il target spesso corrisponde alla prima parte del nome del file di una ricetta (ad esempio, "foo" per un file di ricetta denominato ``foo_1.3.0.bb``). Quindi, per elaborare il file di ricetta ``matchbox-desktop_1.2.3.bb``, si digita quanto segue::

source: The name and contact information for the BSP layer maintainer. This is the person to whom patches and questions should be sent. For information on how to find the right person, see the :doc:`/contributor-guide/submit-changes` section in the Yocto Project and OpenEmbedded Contributor Guide.
it_it: Nome e recapiti del responsabile del layer BSP. Questa è la persona a cui inviare patch e domande. Per informazioni su come trovare la persona giusta, consultare la sezione :doc:`/contributor-guide/submit-changes` della Guida per i Collaboratori di Yocto Project e di OpenEmbedded.

source: The obvious first step for using a layer index is to have several custom layers that developers build and access using the Yocto Project on a regular basis. This set of layers needs to exist and you need to be familiar with where they reside. You will need that information when you set up the code for the web application that "hooks" into your set of layers.
it_it: Il primo passo ovvio per utilizzare un indice di layer è quello di avere diversi layer personalizzati che gli sviluppatori creano e a cui accedono regolarmente tramite Yocto Project. Questo set di layer deve esistere ed è necessario sapere dove si trovano. Queste informazioni saranno necessarie quando si configura il codice per l'applicazione web che si "aggancia" al set di layer.

source: The original `commit message <https://github.com/FFmpeg/FFmpeg/commit/9cf652cef49d74afe3d454f27d49eb1a1394951e.patch/>`__ is::
it_it: Il `messaggio di commit <https://github.com/FFmpeg/FFmpeg/commit/9cf652cef49d74afe3d454f27d49eb1a1394951e.patch/>`__ originale è::

source: The output is a JSON file that itemizes the specific build and includes build summary information. Here is sample output for a specific build:
it_it: L'output è un file JSON che elenca la build specifica e include informazioni di riepilogo. Ecco un esempio di output per una build specifica:

source: The package feed area resides in the :term:`Build Directory`. The directory the build system uses to temporarily store packages is determined by a combination of variables and the particular package manager in use. See the "Package Feeds" box in the illustration and note the information to the right of that area. In particular, the following defines where package files are kept:
it_it: L'area di feed di pacchetti si trova nella :term:`Build Directory`. La directory utilizzata dal sistema di build per memorizzare temporaneamente i pacchetti è determinata da una combinazione di variabili e dal gestore di pacchetti in uso. Consultare il riquadro "Package Feeds" nell'illustrazione e le informazioni a destra di tale area. In particolare, quanto segue definisce la posizione in cui vengono conservati i file dei pacchetti:

source: The part of this process that we're looking at in the above call stacks is the part where the kernel passes the data it has read from the socket down to wget i.e. a ``copy-to-user``.
it_it: La parte di questo processo che stiamo esaminando negli stack di chiamate sopra riportati è quella in cui il kernel passa i dati letti dal socket a wget, ovvero una ``copy-to-user``.
